package _11_basicAPIClass._13_math_random;

// java.lang.Math 클래스: 수학 계산에 사용할 수 있는 메소드 제공.
// -------------------------------------------------------------------------------
// 메소드                              설명              리턴값
// -------------------------------------------------------------------------------
// int abs(int a)                   절대값
// double abs(double a)
// -------------------------------------------------------------------------------
// double ceil(double a)            올림값
// -------------------------------------------------------------------------------
// double floor(double a)           버림값
// -------------------------------------------------------------------------------
// int max(int a, int b)            최대값
// double max(double a, double b)
// -------------------------------------------------------------------------------
// int min(int a, int b)            최소값
// double min(double a, double b)
// -------------------------------------------------------------------------------
// double random()                  랜덤값             0.0 <= v < 1.0
// -------------------------------------------------------------------------------
// double rint(double a)            가까운 정수의 실수값  v1 = 5.0
// -------------------------------------------------------------------------------
// double round(double a)           반올림값           v1 = 5
// -------------------------------------------------------------------------------

public class MathEx1 {
    public static void main(String[] args) {
        // 소수 셋째 자릿수에서 반올림하기.
        double d = 12.3456;
        double t1 = d * 100;
        // round(): 소수점 첫째 자리에서 반올림해서 정수값을 리턴한다. 원하는 소수 자릿수에서 반올림되고 싶으면 10^n 곱한 후 round 후 다시 나눈다.
        long t2 = Math.round(t1);
        double res = t2 / 100.0;
        System.out.println(res);
    }
}
