package _6_class._6_accessModifier;

// 접근 제한자: 클래스, 필드, 생성자, 메소드의 사용을 제한한다.
// -------------------------------------------------------------------------------
// 접근 제한    적용 대상                    접근할 수 없는 클래스
// -------------------------------------------------------------------------------
// public     클래스, 필드, 생성자, 메소드     없음
// protected  필드, 생성자, 메소드           자식 클래스가 아닌 다른 패키지에 소속된 클래스
// default    클래스, 필드, 생성자, 메소드     다른 패키지에 소속된 클래스
// private    필드, 생성자, 메소드           모든 외부 클래스

// 클래스에 적용할 수 있는 접근 제한은 public, default 2가지다.
public class AccessModifierEx1 {
}
