package _11_basicAPIClass._2_lang_util;

// java.lang 패키지: 자바 프로그램의 기본적인 클래스를 담고 있다. 그렇기 때문에 import 없이 사용할 수 있다.
// java.lang 패키지에 속하는 주요 클래스.
// -------------------------------------------------------------------------------
// 클래스                                  용도
// -------------------------------------------------------------------------------
// Object                               자바 클래스의 최상위 클래스로 사용.
// -------------------------------------------------------------------------------
// System                               표준 입력 장치(키보드)로부터 데이터를 입력받을 때 사용
//                                      표준 출력 장치(모니터)로 출력하기 위해 사용
//                                      자바 가상 기계를 종료시킬 때 사용
//                                      쓰레기 수집기를 실행 요청할 때 사용
// -------------------------------------------------------------------------------
// Class                                클래스를 메모리로 로딩할 때 사용
// -------------------------------------------------------------------------------
// String                               문자열을 저장하고 여러가지 정보를 얻을 때 사용
// -------------------------------------------------------------------------------
// StringBuffer, StringBuilder          문자열을 저장하고 내부 문자열을 조작할 때 사용
// -------------------------------------------------------------------------------
// Math                                 수학 함수를 이용할 때 사용
// -------------------------------------------------------------------------------
// Wrapper  | Byte, Short, Character    기본 타입의 데이터를 갖는 객체를 만들 때 사용
//          | Integer, Float, Double    문자열을 기본 타입으로 변환할 때 사용
//          | Boolean, Long             입력값 검사에 사용
// -------------------------------------------------------------------------------
public class LangEx1 {
}
