package _11_basicAPIClass._2_lang_util;

// java.util 패키지: 자바 프로그램 개발에 조미료 같은 역할을 하는 클래스를 담고 있다. 컬렉션 클래스들이 대부분을 차지하고 있다.
// -------------------------------------------------------------------------------
// 클래스              용도
// -------------------------------------------------------------------------------
// Arrays           배열을 조작(비교, 복사, 정렬, 찾기)할 때 사용
// Calendar         운영체제의 날짜와 시간을 얻을 때 사용
// Date             날짜와 시간 정보를 저장하는 클래스
// Objects          객체 비교, 널(null) 여부 등을 조사할 때 사용
// StringTokenizer  특정 문자로 구분된 문자열을 뽑아낼 때 사용
// Random           난수를 얻을 때 사용
// -------------------------------------------------------------------------------
public class UtilEx2 {
}
